tap "antoniorodr/cronboard", trusted: true
tap "arl/arl", trusted: true
tap "boolean-maybe/tap", trusted: true
tap "buildpacks/tap", trusted: true
tap "caarlos0/tap"
tap "charmbracelet/tap", trusted: true
tap "controlplaneio-fluxcd/tap", trusted: true
tap "dagger/tap", trusted: true
tap "dotenvx/brew", trusted: true
tap "elio-fm/elio", trusted: true
tap "floatpane/matcha", trusted: true
tap "fluxcd/tap", trusted: true
tap "gromgit/brewtils", trusted: true
tap "hashicorp/tap", trusted: true
tap "kyverno/chainsaw", "https://github.com/kyverno/chainsaw"
tap "loft-sh/tap", trusted: true
tap "marcus/tap", trusted: true
tap "oven-sh/bun", trusted: true
tap "retlehs/tap", trusted: true
tap "reyamira/tap"
tap "teamookla/speedtest", trusted: true
tap "tilt-dev/tap", trusted: true
tap "vmware-tanzu/buildkit-cli-for-kubectl", "https://github.com/vmware-archive/buildkit-cli-for-kubectl.git"
# Simple, modern, secure file encryption
brew "age"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Browser automation CLI for AI agents
brew "agent-browser"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross platform file encryption utility using blowfish
brew "bcrypt"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Multi-shell multi-command argument completer
brew "carapace"
# Console Matrix
brew "cmatrix"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go Language's command-line interface for database migrations
brew "goose"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Run local Kubernetes cluster in Docker
brew "kind"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes testing according to Hardening Guidance by NSA and CISA
brew "kubescape"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# Find what models run on your hardware
brew "llmfit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Fast TUI and CLI for browsing AI models, benchmarks, and coding agents
brew "models"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Parallel gzip
brew "pigz"
# Modern API client that lives in your terminal
brew "posting"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Simple powerful testing with Python
brew "pytest"
# Better WHOIS and domain intelligence toolkit
brew "quien"
# Smart session manager for the terminal
brew "sesh"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Command driven spotify player
brew "spotify_player"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Non-interactive SSH password auth
brew "sshpass"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# Command-line packet analyzer
brew "tcpdump"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# Terminal-based kanban/scrum board application
brew "boolean-maybe/tap/tiki"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Flux Operator CLI
brew "controlplaneio-fluxcd/tap/flux-operator"
# Flux MCP Server
brew "controlplaneio-fluxcd/tap/flux-operator-mcp"
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger", trusted: true
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# Batteries-included terminal file manager with rich previews
brew "elio-fm/elio/elio"
# A beautiful and functional email client for your terminal.
brew "floatpane/matcha/matcha"
# Flux CLI
brew "fluxcd/tap/flux"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Vault
brew "hashicorp/tap/vault"
# Declarative Kubernetes end-to-end testing.
brew "kyverno/chainsaw/chainsaw"
# A TUI dashboard for AI coding agents
brew "marcus/tap/sidecar"
# Task management CLI for AI-assisted development
brew "marcus/tap/td"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Making local Kubernetes clusters easy to set up and tear down
brew "tilt-dev/tap/ctlptl"
# Terminal-based AI coding assistant
cask "claude-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "agilelog-org.syntax-highlight-for-gherkin"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "alexkrechik.cucumberautocomplete"
vscode "antfu.iconify"
vscode "antfu.unocss"
vscode "benjaminbenais.copilot-theme"
vscode "bjarne.ethereal-omarchy"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "cucumberopen.cucumber-official"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "henriquebruno.github-repository-manager"
vscode "iakimov.check-npm-updates"
vscode "jemo.celestial-echoes"
vscode "markis.code-coverage"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "mrmlnc.vscode-duplicate"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "nuxtr.nuxtr-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prashaantt.node-tdd"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "tabnine.tabnine-vscode"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "upboundio.upbound"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "wscats.vue"
vscode "xabikos.javascriptsnippets"
vscode "zignd.html-css-class-completion"
go "github.com/air-verse/air"
go "github.com/cucumber/godog/cmd/godog"
go "golang.org/x/tools/gopls"
go "github.com/joshmedeski/sesh/v2"
cargo "trippy"
cargo "unifi-tui"
npm "@earendil-works/pi-coding-agent"
npm "@runfusion/fusion"
npm "@samfp/pi-memory"
npm "@upstash/context7-mcp"
npm "context-mode"
npm "diffity"
npm "mcp-hub"
npm "pi-context"
npm "pi-lens"
npm "pi-mcp-adapter"
npm "pi-web-access"
npm "pnpm"
npm "task-master-ai"
