tap "antoniorodr/cronboard"
tap "arl/arl"
tap "boolean-maybe/tap"
tap "buildpacks/tap"
tap "charmbracelet/tap"
tap "dagger/tap"
tap "dotenvx/brew"
tap "hashicorp/tap"
tap "loft-sh/tap"
tap "marcus/tap"
tap "oven-sh/bun"
tap "teamookla/speedtest"
tap "tilt-dev/tap"
tap "vmware-tanzu/buildkit-cli-for-kubectl", "https://github.com/vmware-tanzu/buildkit-cli-for-kubectl"
brew "atuin"
brew "bat"
brew "bcrypt"
brew "gcc"
brew "btop"
brew "buildkit"
brew "carapace"
brew "cmatrix"
brew "eza"
brew "fastfetch"
brew "figlet"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "python@3.14"
brew "git-filter-repo"
brew "go"
brew "gum"
brew "helm"
brew "jq"
brew "k9s"
brew "keychain"
brew "kind"
brew "kubelogin"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "neovim"
brew "node"
brew "nushell"
brew "ripgrep"
brew "opencode"
brew "pigz"
brew "posting"
brew "prettier"
brew "sesh"
brew "socat"
brew "spotify_player"
brew "sshfs"
brew "sshs"
brew "starship"
brew "stow"
brew "superfile"
brew "talosctl"
brew "teleport"
brew "tilt"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "vcluster"
brew "w3m"
brew "wireguard-tools"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zoxide"
brew "arl/arl/gitmux"
brew "boolean-maybe/tap/tiki"
brew "buildpacks/tap/pack"
brew "charmbracelet/tap/crush"
brew "dagger/tap/dagger"
brew "dotenvx/brew/dotenvx"
brew "hashicorp/tap/vault"
brew "marcus/tap/sidecar"
brew "marcus/tap/td"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
brew "tilt-dev/tap/ctlptl"
brew "vmware-tanzu/buildkit-cli-for-kubectl/kubectl-buildkit"
cask "claude-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "agilelog-org.syntax-highlight-for-gherkin"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "alexkrechik.cucumberautocomplete"
vscode "antfu.iconify"
vscode "antfu.unocss"
vscode "benjaminbenais.copilot-theme"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "cucumberopen.cucumber-official"
vscode "dariofuzinato.vue-peek"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "henriquebruno.github-repository-manager"
vscode "iakimov.check-npm-updates"
vscode "markis.code-coverage"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "mrmlnc.vscode-duplicate"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "nuxtr.nuxtr-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prashaantt.node-tdd"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "tabnine.tabnine-vscode"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "upboundio.upbound"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "wscats.vue"
vscode "xabikos.javascriptsnippets"
vscode "zignd.html-css-class-completion"
go "github.com/air-verse/air"
go "golang.org/x/tools/gopls"
go "github.com/joshmedeski/sesh/v2"
cargo "unifi-tui"
