tap "arl/arl"
tap "charmbracelet/tap"
tap "dagger/tap"
tap "dotenvx/brew"
tap "hashicorp/tap"
tap "loft-sh/tap"
tap "teamookla/speedtest"
brew "atuin"
brew "bat"
brew "bcrypt"
brew "btop"
brew "buildkit"
brew "carapace"
brew "clipboard"
brew "cmatrix"
brew "eza"
brew "fastfetch"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "gum"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "meson"
brew "neovim"
brew "node"
brew "nushell"
brew "opencode"
brew "pigz"
brew "posting"
brew "prettier"
brew "sesh"
brew "spotify_player"
brew "sshs"
brew "starship"
brew "stow"
brew "superfile"
brew "talosctl"
brew "tilt"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zoxide"
brew "arl/arl/gitmux"
brew "charmbracelet/tap/crush"
brew "dagger/tap/dagger"
brew "dotenvx/brew/dotenvx"
brew "hashicorp/tap/vault"
brew "loft-sh/tap/vcluster-experimental"
brew "teamookla/speedtest/speedtest"
cask "1password-cli"
